Revit 2027 API
FormArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	Form item,
	int index
)
Public Overridable Sub Insert (
	item As Form,
	index As Integer
)
public:
virtual void Insert(
	Form^ item,
	int index
)
abstract Insert :
        item : Form *
        index : int -> unit
override Insert :
        item : Form *
        index : int -> unit
Parameters
item Form
index Int32
See Also
Reference
FormArray Class
Autodesk.Revit.DB Namespace